apache/mynewt-core/net/nimble/drivers/nrf51/src/ble_phy.c
        /* Set RSSI and CRC status flag in header */
        ble_hdr = BLE_MBUF_HDR_PTR(g_ble_phy_data.rxpdu);
        assert(NRF_RADIO->EVENTS_RSSIEND != 0);
        ble_hdr->rxinfo.rssi = -1 * NRF_RADIO->RSSISAMPLE;
        ble_hdr->end_cputime = NRF_TIMER0->CC[2];
#ifdef BLE_LL_CFG_FEAT_LE_ENCRYPTION
        dptr = g_ble_phy_data.rxpdu->om_data;
#endif
        /* Count PHY crc errors and valid packets */
        crcok = (uint8_t)NRF_RADIO->CRCSTATUS;
        if (!crcok) {
            STATS_INC(ble_phy_stats, rx_crc_err);
        } else {
            STATS_INC(ble_phy_stats, rx_valid);
            ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_CRC_OK;
#ifdef BLE_LL_CFG_FEAT_LE_ENCRYPTION
            if (g_ble_phy_data.phy_encrypted) {
                /* Only set MIC failure flag if frame is not zero length */
                if ((dptr[1] != 0) && (NRF_CCM->MICSTATUS == 0)) {
                    ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_MIC_FAILURE;
                }

                /*
                 * XXX: not sure how to deal with this. This should not
                 * be a MIC failure but we should not hand it up. I guess
                 * this is just some form of rx error and that is how we
                 * handle it? For now, just set CRC error flags
                 */
                if (NRF_CCM->EVENTS_ERROR) {
                    STATS_INC(ble_phy_stats, rx_hw_err);
                    ble_hdr->rxinfo.flags &= ~BLE_MBUF_HDR_F_CRC_OK;
                }

                /*
                 * XXX: This is a total hack work-around for now but I dont
                 * know what else to do. If ENDCRYPT is not set and we are
                 * encrypted we need to not trust this frame and drop it.
                 */
                if (NRF_CCM->EVENTS_ENDCRYPT == 0) {
                    STATS_INC(ble_phy_stats, rx_hw_err);
                    ble_hdr->rxinfo.flags &= ~BLE_MBUF_HDR_F_CRC_OK;
                }
            }
#endif
        }

        /* Call Link Layer receive payload function */
        rxpdu = g_ble_phy_data.rxpdu;
        g_ble_phy_data.rxpdu = NULL;

#ifdef BLE_LL_CFG_FEAT_LE_ENCRYPTION
        if (g_ble_phy_data.phy_encrypted) {
            /*
             * XXX: This is a horrible ugly hack to deal with the RAM S1 byte.
             * This should get fixed as we should not be handing up the header
             * and length as part of the pdu.
             */
            dptr[2] = dptr[1];
            dptr[1] = dptr[0];
            rxpdu->om_data += 1;
        }
#endif
        rc = ble_ll_rx_end(rxpdu, ble_hdr);
        if (rc < 0) {
            ble_phy_disable();
        }
    }

phy_isr_exit:
    /* Ensures IRQ is cleared */
    state = NRF_RADIO->SHORTS;

    /* Count # of interrupts */
    STATS_INC(ble_phy_stats, phy_isrs);
}

/**
 * ble phy init
 *
 * Initialize the PHY.
 *
 * @return int 0: success; PHY error code otherwise
 */
int
ble_phy_init(void)
{
    int rc;
    uint32_t os_tmo;

    /* Make sure HFXO is started */
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART = 1;
    os_tmo = os_time_get() + (5 * (1000 / OS_TICKS_PER_SEC));
    while (1) {
        if (NRF_CLOCK->EVENTS_HFCLKSTARTED) {
            break;
        }
        if ((int32_t)(os_time_get() - os_tmo) > 0) {
            return BLE_PHY_ERR_INIT;
        }
    }

    /* Set phy channel to an invalid channel so first set channel works */
    g_ble_phy_data.phy_chan = BLE_PHY_NUM_CHANS;

    /* Toggle peripheral power to reset (just in case) */
    NRF_RADIO->POWER = 0;
    NRF_RADIO->POWER = 1;

    /* Disable all interrupts */
    NRF_RADIO->INTENCLR = NRF_RADIO_IRQ_MASK_ALL;

    /* Set configuration registers */
    NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_1Mbit;
    NRF_RADIO->PCNF0 = (NRF_LFLEN_BITS << RADIO_PCNF0_LFLEN_Pos) |
                       (NRF_S0_LEN << RADIO_PCNF0_S0LEN_Pos);
    /* XXX: should maxlen be 251 for encryption? */
    NRF_RADIO->PCNF1 = NRF_MAXLEN |
                       (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                       (NRF_BALEN << RADIO_PCNF1_BALEN_Pos) |
                       RADIO_PCNF1_WHITEEN_Msk;

    /* Set base0 with the advertising access address */
    NRF_RADIO->BASE0 = (BLE_ACCESS_ADDR_ADV << 8) & 0xFFFFFF00;
    NRF_RADIO->PREFIX0 = (BLE_ACCESS_ADDR_ADV >> 24) & 0xFF;

    /* Configure the CRC registers */
    NRF_RADIO->CRCCNF = RADIO_CRCCNF_SKIPADDR_Msk | RADIO_CRCCNF_LEN_Three;

    /* Configure BLE poly */
    NRF_RADIO->CRCPOLY = 0x0100065B;

    /* Configure IFS */
    NRF_RADIO->TIFS = BLE_LL_IFS;

    /*
     * Enable the pre-programmed PPI to capture the time when a receive
     * or transmit ends
     */
    NRF_PPI->CHENSET = PPI_CHEN_CH27_Msk;

#ifdef BLE_LL_CFG_FEAT_LE_ENCRYPTION
    NRF_CCM->INTENCLR = 0xffffffff;
    NRF_CCM->SHORTS = CCM_SHORTS_ENDKSGEN_CRYPT_Msk;
    NRF_CCM->ENABLE = CCM_ENABLE_ENABLE_Enabled;
    NRF_CCM->EVENTS_ERROR = 0;
    memset(g_nrf_encrypt_scratchpad, 0, sizeof(g_nrf_encrypt_scratchpad));
#endif

    /* Set isr in vector table and enable interrupt */
    NVIC_SetPriority(RADIO_IRQn, 0);
    NVIC_SetVector(RADIO_IRQn, (uint32_t)ble_phy_isr);
    NVIC_EnableIRQ(RADIO_IRQn);

    /* Register phy statistics */
    if (!g_ble_phy_data.phy_stats_initialized) {
        rc = stats_init_and_reg(STATS_HDR(ble_phy_stats),
                                STATS_SIZE_INIT_PARMS(ble_phy_stats,
                                                      STATS_SIZE_32),
                                STATS_NAME_INIT_PARMS(ble_phy_stats),
                                "ble_phy");
        assert(rc == 0);

        g_ble_phy_data.phy_stats_initialized  = 1;
    }

    return 0;
}

/**
 * Puts the phy into receive mode.
 *
 * @return int 0: success; BLE Phy error code otherwise
 */
int
ble_phy_rx(void)
{
    /* Check radio state */
    nrf_wait_disabled();
    if (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled) {
        ble_phy_disable();
        STATS_INC(ble_phy_stats, radio_state_errs);
        return BLE_PHY_ERR_RADIO_STATE;
    }

    /* If no pdu, get one */
    if (ble_phy_rxpdu_get() == NULL) {
        return BLE_PHY_ERR_NO_BUFS;
    }

    /* Make sure all interrupts are disabled */
    NRF_RADIO->INTENCLR = NRF_RADIO_IRQ_MASK_ALL;

